{"data": {"CAPA": {"tactics": [{"id": "TA0007", "name": "Discovery", "link": "https://attack.mitre.org/tactics/TA0007/", "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ", "techniques": [{"id": "T1083", "name": "File and Directory Discovery", "link": "https://attack.mitre.org/techniques/T1083/", "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.", "signatures": [{"severity": "INFO", "description": "check if directory exists"}, {"severity": "INFO", "description": "check if file exists"}]}]}, {"id": "TA0005", "name": "Defense Evasion", "link": "https://attack.mitre.org/tactics/TA0005/", "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ", "techniques": [{"id": "T1620", "name": "Reflective Code Loading", "link": "https://attack.mitre.org/techniques/T1620/", "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads. Reflective loading involves allocating then executing payloads directly within the memory of the process, vice creating a thread or process backed by a file path on disk (e.g., Shared Modules).\nReflectively loaded payloads may be compiled binaries, anonymous files (only present in RAM), or just snubs of fileless executable code (ex: position-independent shellcode). For example, the Assembly.Load() method executed by PowerShell may be abused to load raw code into the running process.\nReflective code injection is very similar to Process Injection except that the “injection” loads code into the processes’ own memory instead of that of a separate process. Reflective loading may evade process-based detections since the execution of the arbitrary code may be masked within a legitimate or otherwise benign process. Reflectively loading payloads directly into memory may also avoid creating files or other artifacts on disk, while also enabling malware to keep these payloads encrypted (or otherwise obfuscated) until execution.", "signatures": [{"severity": "INFO", "description": "load .NET assembly"}]}]}, {"id": "TA0009", "name": "Collection", "link": "https://attack.mitre.org/tactics/TA0009/", "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.", "techniques": [{"id": "T1213", "name": "Data from Information Repositories", "link": "https://attack.mitre.org/techniques/T1213/", "description": "Adversaries may leverage information repositories to mine valuable information. Information repositories are tools that allow for storage of information, typically to facilitate collaboration or information sharing between users, and can store a wide variety of data that may aid adversaries in further objectives, such as Credential Access, Lateral Movement, or Defense Evasion, or direct access to the target information. Adversaries may also abuse external sharing features to share sensitive documents with recipients outside of the organization (i.e., Transfer Data to Cloud Account). \nThe following is a brief list of example information that may hold potential value to an adversary and may also be found on an information repository:\n\nPolicies, procedures, and standards\nPhysical / logical network diagrams\nSystem architecture diagrams\nTechnical system documentation\nTesting / development credentials (i.e., Unsecured Credentials) \nWork / project schedules\nSource code snippets\nLinks to network shares and other internal resources\nContact or other sensitive information about business partners and customers, including personally identifiable information (PII) \n\nInformation stored in a repository may vary based on the specific instance or environment. Specific common information repositories include the following:\n\nStorage services such as IaaS databases, enterprise databases, and more specialized platforms such as customer relationship management (CRM) databases \nCollaboration platforms such as SharePoint, Confluence, and code repositories\nMessaging platforms such as Slack and Microsoft Teams \n\nIn some cases, information repositories have been improperly secured, typically by unintentionally allowing for overly-broad access by all users or even public access to unauthenticated users. This is particularly common with cloud-native or cloud-hosted services, such as AWS Relational Database Service (RDS), Redis, or ElasticSearch.", "signatures": [{"severity": "INFO", "description": "reference SQL statements"}]}]}]}, "CAPE Sandbox": {"tactics": [{"id": "TA0011", "name": "Command and Control", "link": "https://attack.mitre.org/tactics/TA0011/", "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.", "techniques": [{"id": "T1071", "name": "Application Layer Protocol", "link": "https://attack.mitre.org/techniques/T1071/", "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ", "signatures": [{"severity": "UNKNOWN", "description": "Adversaries may communicate using application layer protocols to avoid detection/network filtering by blending in with existing traffic."}]}]}, {"id": "TA0002", "name": "Execution", "link": "https://attack.mitre.org/tactics/TA0002/", "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ", "techniques": [{"id": "T1106", "name": "Native API", "link": "https://attack.mitre.org/techniques/T1106/", "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.\nAdversaries may abuse these OS API functions as a means of executing behaviors. Similar to Command and Scripting Interpreter, the native API and its hierarchy of interfaces provide mechanisms to interact with and utilize various components of a victimized system.\nNative API functions (such as NtCreateProcess) may be directed invoked via system calls / syscalls, but these features are also often exposed to user-mode applications via interfaces and libraries. For example, functions such as the Windows API CreateProcess() or GNU fork() will allow programs and scripts to start other processes. This may allow API callers to execute a binary, run a CLI command, load modules, etc. as thousands of similar API functions exist for various system operations.\nHigher level software frameworks, such as Microsoft .NET and macOS Cocoa, are also available to interact with native APIs. These frameworks typically provide language wrappers/abstractions to API functionalities and are designed for ease-of-use/portability of code.\nAdversaries may use assembly to directly or in-directly invoke syscalls in an attempt to subvert defensive sensors and detection signatures such as user mode API-hooks. Adversaries may also attempt to tamper with sensors and defensive tools associated with API monitoring, such as unhooking monitored functions via Disable or Modify Tools.", "signatures": [{"severity": "UNKNOWN", "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors."}]}]}]}, "VMRay": {"tactics": [{"id": "TA0005", "name": "Defense Evasion", "link": "https://attack.mitre.org/tactics/TA0005/", "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ", "techniques": [{"id": "T1143", "name": "Hidden Window", "link": "https://attack.mitre.org/techniques/T1143/", "description": "Adversaries may implement hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. Adversaries may abuse operating system functionality to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nWindows\nThere are a variety of features in scripting languages in Windows, such as PowerShell, Jscript, and VBScript to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.  \nMac\nThe configurations for how applications run on macOS are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock. However, adversaries can abuse this feature and hide their running window.", "signatures": [{"severity": "INFO", "description": "(Process #1) rsoa2023-50hapaglloyd.exe starts (process #4) powershell.exe with a hidden window."}]}, {"id": "T1045", "name": "Software Packing", "link": "https://attack.mitre.org/techniques/T1045/", "description": "Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory.\nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available,  but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.\nAdversaries may use virtual machine software protection as a form of software packing to protect their code. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code.", "signatures": [{"severity": "INFO", "description": "(Process #1) rsoa2023-50hapaglloyd.exe allocates a page in a foreign process with \"PAGE_EXECUTE_READWRITE\" permissions, often used to dynamically unpack code."}]}]}, {"id": "TA0007", "name": "Discovery", "link": "https://attack.mitre.org/tactics/TA0007/", "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ", "techniques": [{"id": "T1057", "name": "Process Discovery", "link": "https://attack.mitre.org/techniques/T1057/", "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.", "signatures": [{"severity": "INFO", "description": "(Process #1) rsoa2023-50hapaglloyd.exe enumerates running processes."}]}]}, {"id": "TA0002", "name": "Execution", "link": "https://attack.mitre.org/tactics/TA0002/", "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ", "techniques": [{"id": "T1053", "name": "Scheduled Task/Job", "link": "https://attack.mitre.org/techniques/T1053/", "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.", "signatures": [{"severity": "LOW", "description": "Schedules task for command \"C:\\Users\\OqXZRaykm\\AppData\\Roaming\\eLfOjcpKuVq.exe\", to be triggered by LOGON."}]}]}, {"id": "TA0003", "name": "Persistence", "link": "https://attack.mitre.org/tactics/TA0003/", "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ", "techniques": [{"id": "T1053", "name": "Scheduled Task/Job", "link": "https://attack.mitre.org/techniques/T1053/", "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.", "signatures": [{"severity": "LOW", "description": "Schedules task for command \"C:\\Users\\OqXZRaykm\\AppData\\Roaming\\eLfOjcpKuVq.exe\", to be triggered by LOGON."}]}]}, {"id": "TA0004", "name": "Privilege Escalation", "link": "https://attack.mitre.org/tactics/TA0004/", "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ", "techniques": [{"id": "T1053", "name": "Scheduled Task/Job", "link": "https://attack.mitre.org/techniques/T1053/", "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.", "signatures": [{"severity": "LOW", "description": "Schedules task for command \"C:\\Users\\OqXZRaykm\\AppData\\Roaming\\eLfOjcpKuVq.exe\", to be triggered by LOGON."}]}]}]}, "Zenbox": {"tactics": [{"id": "TA0002", "name": "Execution", "link": "https://attack.mitre.org/tactics/TA0002/", "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ", "techniques": [{"id": "T1047", "name": "Windows Management Instrumentation", "link": "https://attack.mitre.org/techniques/T1047/", "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is designed for programmers and is the infrastructure for management data and operations on Windows systems. WMI is an administration feature that provides a uniform environment to access Windows system components.\nThe WMI service enables both local and remote access, though the latter is facilitated by Remote Services such as Distributed Component Object Model and Windows Remote Management. Remote WMI over DCOM operates using port 135, whereas WMI over WinRM operates over port 5985 when using HTTP and 5986 for HTTPS. \nAn adversary can use WMI to interact with local and remote systems and use it as a means to execute various behaviors, such as gathering information for Discovery as well as Execution of commands and payloads. For example, wmic.exe can be abused by an adversary to delete shadow copies with the command wmic.exe Shadowcopy Delete (i.e., Inhibit System Recovery).\nNote: wmic.exe is deprecated as of January of 2024, with the WMIC feature being “disabled by default” on Windows 11+. WMIC will be removed from subsequent Windows releases and replaced by PowerShell as the primary WMI interface. In addition to PowerShell and tools like wbemtool.exe, COM APIs can also be used to programmatically interact with WMI via C++, .NET, VBScript, etc.", "signatures": [{"severity": "LOW", "description": "Queries BIOS Information (via WMI, Win32_Bios)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_BaseBoard"]}, {"severity": "INFO", "description": "Queries process information (via WMI, Win32_Process)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_Processor", "IWbemServices::ExecQuery - root\\cimv2 : SELECT * FROM Win32_Processor"]}, {"severity": "LOW", "description": "Queries sensitive network adapter information (via WMI, Win32_NetworkAdapter, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_NetworkAdapterConfiguration"]}, {"severity": "INFO", "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_Processor", "IWbemServices::ExecQuery - root\\cimv2 : SELECT * FROM Win32_Processor"]}]}, {"id": "T1053", "name": "Scheduled Task/Job", "link": "https://attack.mitre.org/techniques/T1053/", "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.", "signatures": [{"severity": "LOW", "description": "Uses schtasks.exe or at.exe to add and modify task schedules", "match_data": ["C:\\Windows\\SysWOW64\\schtasks.exe C:\\Windows\\System32\\schtasks.exe\" /Create /TN \"Updates\\eLfOjcpKuVq\" /XML \"C:\\Users\\user\\AppData\\Local\\Temp\\tmp482C.tmp"]}]}]}, {"id": "TA0003", "name": "Persistence", "link": "https://attack.mitre.org/tactics/TA0003/", "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ", "techniques": [{"id": "T1053", "name": "Scheduled Task/Job", "link": "https://attack.mitre.org/techniques/T1053/", "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.", "signatures": [{"severity": "LOW", "description": "Uses schtasks.exe or at.exe to add and modify task schedules", "match_data": ["C:\\Windows\\SysWOW64\\schtasks.exe C:\\Windows\\System32\\schtasks.exe\" /Create /TN \"Updates\\eLfOjcpKuVq\" /XML \"C:\\Users\\user\\AppData\\Local\\Temp\\tmp482C.tmp"]}]}]}, {"id": "TA0004", "name": "Privilege Escalation", "link": "https://attack.mitre.org/tactics/TA0004/", "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ", "techniques": [{"id": "T1053", "name": "Scheduled Task/Job", "link": "https://attack.mitre.org/techniques/T1053/", "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.", "signatures": [{"severity": "LOW", "description": "Uses schtasks.exe or at.exe to add and modify task schedules", "match_data": ["C:\\Windows\\SysWOW64\\schtasks.exe C:\\Windows\\System32\\schtasks.exe\" /Create /TN \"Updates\\eLfOjcpKuVq\" /XML \"C:\\Users\\user\\AppData\\Local\\Temp\\tmp482C.tmp"]}]}, {"id": "T1055", "name": "Process Injection", "link": "https://attack.mitre.org/techniques/T1055/", "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ", "signatures": [{"severity": "LOW", "description": "Injects a PE file into a foreign processes", "match_data": ["C:\\Users\\user\\Desktop\\executable.exe base: 400000 value starts with: 4D5A"]}]}]}, {"id": "TA0005", "name": "Defense Evasion", "link": "https://attack.mitre.org/tactics/TA0005/", "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ", "techniques": [{"id": "T1055", "name": "Process Injection", "link": "https://attack.mitre.org/techniques/T1055/", "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ", "signatures": [{"severity": "LOW", "description": "Injects a PE file into a foreign processes", "match_data": ["C:\\Users\\user\\Desktop\\executable.exe base: 400000 value starts with: 4D5A"]}]}, {"id": "T1036", "name": "Masquerading", "link": "https://attack.mitre.org/techniques/T1036/", "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\nRenaming abusable system utilities to evade security monitoring is also a form of Masquerading.", "signatures": [{"severity": "INFO", "description": "Creates files inside the user directory", "match_data": ["C:\\Users\\user\\AppData\\Roaming\\eLfOjcpKuVq.exe"]}]}, {"id": "T1562", "name": "Impair Defenses", "link": "https://attack.mitre.org/techniques/T1562/", "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."}, {"id": "T1562.001", "name": "Disable or Modify Tools", "link": "https://attack.mitre.org/techniques/T1562/001/", "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. Alternatively, they may add new directories to an endpoint detection and response (EDR) tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.", "signatures": [{"severity": "INFO", "description": "Creates guard pages, often used to prevent reverse engineering and debugging", "match_data": ["page read and write | page guard"]}, {"severity": "LOW", "description": "Adds a directory exclusion to Windows Defender", "match_data": ["C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" Add-MpPreference -ExclusionPath \"C:\\Users\\user\\AppData\\Roaming\\eLfOjcpKuVq.exe"]}]}, {"id": "T1497", "name": "Virtualization/Sandbox Evasion", "link": "https://attack.mitre.org/techniques/T1497/", "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.", "signatures": [{"severity": "INFO", "description": "Contains long sleeps (>= 3 min)", "match_data": ["delay time: 922337203685477"]}, {"severity": "INFO", "description": "May sleep (evasive loops) to hinder dynamic analysis", "match_data": ["-922337203685477s >= -30000s", "-1844674407370954s >= -30000s", "-5534023222112862s >= -30000s", "-100000s >= -30000s", "985 > 30", "-99875s >= -30000s", "2098 > 30", "-99750s >= -30000s", "-99641s >= -30000s", "-99531s >= -30000s", "-99422s >= -30000s", "-99313s >= -30000s", "-99203s >= -30000s", "-99094s >= -30000s", "-60000s >= -30000s", "-98969s >= -30000s", "-98859s >= -30000s", "-98750s >= -30000s", "-98641s >= -30000s", "-98531s >= -30000s", "-98422s >= -30000s", "-98313s >= -30000s", "-2767011611056431s >= -30000s", "371 > 30", "-99874s >= -30000s", "1547 > 30", "-99765s >= -30000s", "-99656s >= -30000s", "-99546s >= -30000s", "-99437s >= -30000s", "-99327s >= -30000s", "-99218s >= -30000s", "-99109s >= -30000s", "-99000s >= -30000s"]}, {"severity": "INFO", "description": "Contains medium sleeps (>= 30s)", "match_data": ["delay time: 922337203685477", "delay time: 100000", "delay time: 99875", "delay time: 99750", "delay time: 99641", "delay time: 99531", "delay time: 99422", "delay time: 99313", "delay time: 99203", "delay time: 99094", "delay time: 98969", "delay time: 98859", "delay time: 98750", "delay time: 98641", "delay time: 98531", "delay time: 98422", "delay time: 98313", "delay time: 99874", "delay time: 99765", "delay time: 99656", "delay time: 99546", "delay time: 99437", "delay time: 99327", "delay time: 99218", "delay time: 99109", "delay time: 99000"]}, {"severity": "LOW", "description": "Queries sensitive network adapter information (via WMI, Win32_NetworkAdapter, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_NetworkAdapterConfiguration"]}, {"severity": "INFO", "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_Processor", "IWbemServices::ExecQuery - root\\cimv2 : SELECT * FROM Win32_Processor"]}]}, {"id": "T1027", "name": "Obfuscated Files or Information", "link": "https://attack.mitre.org/techniques/T1027/", "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ", "signatures": [{"severity": "INFO", "description": "Binary may include packed or crypted data", "match_data": ["section name: .text entropy: 7.037185951420323"]}]}, {"id": "T1027.002", "name": "Software Packing", "link": "https://attack.mitre.org/techniques/T1027/002/", "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ", "signatures": [{"severity": "LOW", "description": ".NET source code contains potential unpacker", "match_data": ["InitializeComponent System.Reflection.Assembly.Load(byte[])"]}, {"severity": "INFO", "description": "Binary may include packed or crypted data", "match_data": ["section name: .text entropy: 7.037185951420323"]}]}]}, {"id": "TA0007", "name": "Discovery", "link": "https://attack.mitre.org/tactics/TA0007/", "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ", "techniques": [{"id": "T1497", "name": "Virtualization/Sandbox Evasion", "link": "https://attack.mitre.org/techniques/T1497/", "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.", "signatures": [{"severity": "INFO", "description": "Contains long sleeps (>= 3 min)", "match_data": ["delay time: 922337203685477"]}, {"severity": "INFO", "description": "May sleep (evasive loops) to hinder dynamic analysis", "match_data": ["-922337203685477s >= -30000s", "-1844674407370954s >= -30000s", "-5534023222112862s >= -30000s", "-100000s >= -30000s", "985 > 30", "-99875s >= -30000s", "2098 > 30", "-99750s >= -30000s", "-99641s >= -30000s", "-99531s >= -30000s", "-99422s >= -30000s", "-99313s >= -30000s", "-99203s >= -30000s", "-99094s >= -30000s", "-60000s >= -30000s", "-98969s >= -30000s", "-98859s >= -30000s", "-98750s >= -30000s", "-98641s >= -30000s", "-98531s >= -30000s", "-98422s >= -30000s", "-98313s >= -30000s", "-2767011611056431s >= -30000s", "371 > 30", "-99874s >= -30000s", "1547 > 30", "-99765s >= -30000s", "-99656s >= -30000s", "-99546s >= -30000s", "-99437s >= -30000s", "-99327s >= -30000s", "-99218s >= -30000s", "-99109s >= -30000s", "-99000s >= -30000s"]}, {"severity": "INFO", "description": "Contains medium sleeps (>= 30s)", "match_data": ["delay time: 922337203685477", "delay time: 100000", "delay time: 99875", "delay time: 99750", "delay time: 99641", "delay time: 99531", "delay time: 99422", "delay time: 99313", "delay time: 99203", "delay time: 99094", "delay time: 98969", "delay time: 98859", "delay time: 98750", "delay time: 98641", "delay time: 98531", "delay time: 98422", "delay time: 98313", "delay time: 99874", "delay time: 99765", "delay time: 99656", "delay time: 99546", "delay time: 99437", "delay time: 99327", "delay time: 99218", "delay time: 99109", "delay time: 99000"]}, {"severity": "LOW", "description": "Queries sensitive network adapter information (via WMI, Win32_NetworkAdapter, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_NetworkAdapterConfiguration"]}, {"severity": "INFO", "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_Processor", "IWbemServices::ExecQuery - root\\cimv2 : SELECT * FROM Win32_Processor"]}]}, {"id": "T1012", "name": "Query Registry", "link": "https://attack.mitre.org/techniques/T1012/", "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.", "signatures": [{"severity": "INFO", "description": "Monitors certain registry keys / values for changes (often done to protect autostart functionality)", "match_data": ["HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\AuthRoot", "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows Defender"]}]}, {"id": "T1518", "name": "Software Discovery", "link": "https://attack.mitre.org/techniques/T1518/", "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment. Adversaries may use the information from Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nSuch software may be deployed widely across the environment for configuration management or security reasons, such as Software Deployment Tools, and may allow adversaries broad access to infect devices or move laterally.\nAdversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable to Exploitation for Privilege Escalation."}, {"id": "T1518.001", "name": "Security Software Discovery", "link": "https://attack.mitre.org/techniques/T1518/001/", "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment. This may include things such as cloud monitoring agents and anti-virus. Adversaries may use the information from Security Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nExample commands that can be used to obtain security software information are netsh, reg query with Reg, dir with cmd, and Tasklist, but other indicators of discovery behavior may be more specific to the type of software or security system the adversary is looking for. It is becoming more common to see macOS malware perform checks for LittleSnitch and KnockKnock software.\nAdversaries may also utilize the Cloud API to discover cloud-native security software installed on compute infrastructure, such as the AWS CloudWatch agent, Azure VM Agent, and Google Cloud Monitor agent. These agents  may collect  metrics and logs from the VM, which may be centrally aggregated in a cloud-based monitoring platform.", "signatures": [{"severity": "LOW", "description": "Queries sensitive network adapter information (via WMI, Win32_NetworkAdapter, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_NetworkAdapterConfiguration"]}, {"severity": "INFO", "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_Processor", "IWbemServices::ExecQuery - root\\cimv2 : SELECT * FROM Win32_Processor"]}, {"severity": "INFO", "description": "May try to detect the virtual machine to hinder analysis (VM artifact strings found in memory)", "match_data": ["Hyper-V RAW0", "Hyper-V RAW", "Hyper-V RAW%SystemRoot%\\system32\\mswsock.dll="]}]}, {"id": "T1057", "name": "Process Discovery", "link": "https://attack.mitre.org/techniques/T1057/", "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.", "signatures": [{"severity": "INFO", "description": "Queries a list of all running processes", "match_data": ["ProcessInformation"]}]}, {"id": "T1010", "name": "Application Window Discovery", "link": "https://attack.mitre.org/techniques/T1010/", "description": "Adversaries may attempt to get a listing of open application windows. Window listings could convey information about how the system is used. For example, information about application windows could be used identify potential data to collect as well as identifying security tooling (Security Software Discovery) to evade.\nAdversaries typically abuse system features for this type of enumeration. For example, they may gather information through native system features such as Command and Scripting Interpreter commands and Native API functions.", "signatures": [{"severity": "INFO", "description": "Sample monitors Window changes (e.g. starting applications), analyze the sample with the simulation cookbook"}]}, {"id": "T1018", "name": "Remote System Discovery", "link": "https://attack.mitre.org/techniques/T1018/", "description": "Adversaries may attempt to get a listing of other systems by IP address, hostname, or other logical identifier on a network that may be used for Lateral Movement from the current system. Functionality could exist within remote access tools to enable this, but utilities available on the operating system could also be used such as  Ping, net view using Net, or, on ESXi servers, esxcli network diag ping.\nAdversaries may also analyze data from local host files (ex: C:\\Windows\\System32\\Drivers\\etc\\hosts or /etc/hosts) or other passive means (such as local Arp cache entries) in order to discover the presence of remote systems in an environment.\nAdversaries may also target discovery of network infrastructure as well as leverage Network Device CLI commands on network devices to gather detailed information about systems within a network (e.g. show cdp neighbors, show arp).  ", "signatures": [{"severity": "INFO", "description": "Reads the hosts file", "match_data": ["C:\\Windows\\System32\\drivers\\etc\\hosts"]}]}, {"id": "T1083", "name": "File and Directory Discovery", "link": "https://attack.mitre.org/techniques/T1083/", "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.", "signatures": [{"severity": "INFO", "description": "Reads ini files", "match_data": ["C:\\Users\\user\\Desktop\\desktop.ini"]}]}, {"id": "T1082", "name": "System Information Discovery", "link": "https://attack.mitre.org/techniques/T1082/", "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ", "signatures": [{"severity": "INFO", "description": "Queries the volume information (name, serial number etc) of a device", "match_data": ["C:\\Users\\user\\Desktop\\executable.exe VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Windows.Forms\\v4.0_4.0.0.0__b77a5c561934e089\\System.Windows.Forms.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Drawing\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\System.Drawing.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Accessibility\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\Accessibility.dll VolumeInformation", "C:\\Windows\\Fonts\\arial.ttf VolumeInformation", "C:\\Windows\\Fonts\\ariali.ttf VolumeInformation", "C:\\Windows\\Fonts\\arialbd.ttf VolumeInformation", "C:\\Windows\\Fonts\\arialbi.ttf VolumeInformation", "C:\\Windows\\Fonts\\ARIALN.TTF VolumeInformation", "C:\\Windows\\Fonts\\ariblk.ttf VolumeInformation", "C:\\Windows\\Fonts\\ARIALNI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ARIALNB.TTF VolumeInformation", "C:\\Windows\\Fonts\\ARIALNBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\bahnschrift.ttf VolumeInformation", "C:\\Windows\\Fonts\\calibri.ttf VolumeInformation", "C:\\Windows\\Fonts\\calibril.ttf VolumeInformation", "C:\\Windows\\Fonts\\calibrii.ttf VolumeInformation", "C:\\Windows\\Fonts\\calibrili.ttf VolumeInformation", "C:\\Windows\\Fonts\\calibrib.ttf VolumeInformation", "C:\\Windows\\Fonts\\calibriz.ttf VolumeInformation", "C:\\Windows\\Fonts\\cambria.ttc VolumeInformation", "C:\\Windows\\Fonts\\cambriai.ttf VolumeInformation", "C:\\Windows\\Fonts\\cambriab.ttf VolumeInformation", "C:\\Windows\\Fonts\\cambriaz.ttf VolumeInformation", "C:\\Windows\\Fonts\\Candara.ttf VolumeInformation", "C:\\Windows\\Fonts\\Candarai.ttf VolumeInformation", "C:\\Windows\\Fonts\\Candarab.ttf VolumeInformation", "C:\\Windows\\Fonts\\Candaraz.ttf VolumeInformation", "C:\\Windows\\Fonts\\comic.ttf VolumeInformation", "C:\\Windows\\Fonts\\comici.ttf VolumeInformation", "C:\\Windows\\Fonts\\comicbd.ttf VolumeInformation", "C:\\Windows\\Fonts\\comicz.ttf VolumeInformation", "C:\\Windows\\Fonts\\consola.ttf VolumeInformation", "C:\\Windows\\Fonts\\consolai.ttf VolumeInformation", "C:\\Windows\\Fonts\\consolab.ttf VolumeInformation", "C:\\Windows\\Fonts\\consolaz.ttf VolumeInformation", "C:\\Windows\\Fonts\\constan.ttf VolumeInformation", "C:\\Windows\\Fonts\\constani.ttf VolumeInformation", "C:\\Windows\\Fonts\\constanb.ttf VolumeInformation", "C:\\Windows\\Fonts\\constanz.ttf VolumeInformation", "C:\\Windows\\Fonts\\corbel.ttf VolumeInformation", "C:\\Windows\\Fonts\\corbeli.ttf VolumeInformation", "C:\\Windows\\Fonts\\corbelb.ttf VolumeInformation", "C:\\Windows\\Fonts\\corbelz.ttf VolumeInformation", "C:\\Windows\\Fonts\\cour.ttf VolumeInformation", "C:\\Windows\\Fonts\\couri.ttf VolumeInformation", "C:\\Windows\\Fonts\\courbd.ttf VolumeInformation", "C:\\Windows\\Fonts\\courbi.ttf VolumeInformation", "C:\\Windows\\Fonts\\ebrima.ttf VolumeInformation", "C:\\Windows\\Fonts\\ebrimabd.ttf VolumeInformation", "C:\\Windows\\Fonts\\framd.ttf VolumeInformation", "C:\\Windows\\Fonts\\FRADM.TTF VolumeInformation", "C:\\Windows\\Fonts\\framdit.ttf VolumeInformation", "C:\\Windows\\Fonts\\FRADMIT.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRAMDCN.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRADMCN.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRAHV.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRAHVIT.TTF VolumeInformation", "C:\\Windows\\Fonts\\Gabriola.ttf VolumeInformation", "C:\\Windows\\Fonts\\gadugi.ttf VolumeInformation", "C:\\Windows\\Fonts\\gadugib.ttf VolumeInformation", "C:\\Windows\\Fonts\\georgia.ttf VolumeInformation", "C:\\Windows\\Fonts\\georgiai.ttf VolumeInformation", "C:\\Windows\\Fonts\\georgiab.ttf VolumeInformation", "C:\\Windows\\Fonts\\georgiaz.ttf VolumeInformation", "C:\\Windows\\Fonts\\holomdl2.ttf VolumeInformation", "C:\\Windows\\Fonts\\impact.ttf VolumeInformation", "C:\\Windows\\Fonts\\Inkfree.ttf VolumeInformation", "C:\\Windows\\Fonts\\javatext.ttf VolumeInformation", "C:\\Windows\\Fonts\\LeelawUI.ttf VolumeInformation", "C:\\Windows\\Fonts\\LeelUIsl.ttf VolumeInformation", "C:\\Windows\\Fonts\\LeelaUIb.ttf VolumeInformation", "C:\\Windows\\Fonts\\lucon.ttf VolumeInformation", "C:\\Windows\\Fonts\\l_10646.ttf VolumeInformation", "C:\\Windows\\Fonts\\malgun.ttf VolumeInformation", "C:\\Windows\\Fonts\\malgunsl.ttf VolumeInformation", "C:\\Windows\\Fonts\\malgunbd.ttf VolumeInformation", "C:\\Windows\\Fonts\\himalaya.ttf VolumeInformation", "C:\\Windows\\Fonts\\msjh.ttc VolumeInformation", "C:\\Windows\\Fonts\\msjhl.ttc VolumeInformation", "C:\\Windows\\Fonts\\msjhbd.ttc VolumeInformation", "C:\\Windows\\Fonts\\ntailu.ttf VolumeInformation", "C:\\Windows\\Fonts\\ntailub.ttf VolumeInformation", "C:\\Windows\\Fonts\\phagspa.ttf VolumeInformation", "C:\\Windows\\Fonts\\phagspab.ttf VolumeInformation", "C:\\Windows\\Fonts\\micross.ttf VolumeInformation", "C:\\Windows\\Fonts\\taile.ttf VolumeInformation", "C:\\Windows\\Fonts\\taileb.ttf VolumeInformation", "C:\\Windows\\Fonts\\msyh.ttc VolumeInformation", "C:\\Windows\\Fonts\\msyhl.ttc VolumeInformation", "C:\\Windows\\Fonts\\msyhbd.ttc VolumeInformation", "C:\\Windows\\Fonts\\msyi.ttf VolumeInformation", "C:\\Windows\\Fonts\\mingliub.ttc VolumeInformation", "C:\\Windows\\Fonts\\monbaiti.ttf VolumeInformation", "C:\\Windows\\Fonts\\msgothic.ttc VolumeInformation", "C:\\Windows\\Fonts\\mvboli.ttf VolumeInformation", "C:\\Windows\\Fonts\\mmrtext.ttf VolumeInformation", "C:\\Windows\\Fonts\\mmrtextb.ttf VolumeInformation", "C:\\Windows\\Fonts\\Nirmala.ttf VolumeInformation", "C:\\Windows\\Fonts\\NirmalaS.ttf VolumeInformation", "C:\\Windows\\Fonts\\NirmalaB.ttf VolumeInformation", "C:\\Windows\\Fonts\\pala.ttf VolumeInformation", "C:\\Windows\\Fonts\\palai.ttf VolumeInformation", "C:\\Windows\\Fonts\\palab.ttf VolumeInformation", "C:\\Windows\\Fonts\\palabi.ttf VolumeInformation", "C:\\Windows\\Fonts\\segoepr.ttf VolumeInformation", "C:\\Windows\\Fonts\\segoeprb.ttf VolumeInformation", "C:\\Windows\\Fonts\\segoesc.ttf VolumeInformation", "C:\\Windows\\Fonts\\segoescb.ttf VolumeInformation", "C:\\Windows\\Fonts\\segoeuii.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguisli.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguili.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguisbi.ttf VolumeInformation", "C:\\Windows\\Fonts\\segoeuiz.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguibl.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguibli.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguiemj.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguihis.ttf VolumeInformation", "C:\\Windows\\Fonts\\seguisym.ttf VolumeInformation", "C:\\Windows\\Fonts\\simsun.ttc VolumeInformation", "C:\\Windows\\Fonts\\simsunb.ttf VolumeInformation", "C:\\Windows\\Fonts\\Sitka.ttc VolumeInformation", "C:\\Windows\\Fonts\\SitkaI.ttc VolumeInformation", "C:\\Windows\\Fonts\\SitkaB.ttc VolumeInformation", "C:\\Windows\\Fonts\\SitkaZ.ttc VolumeInformation", "C:\\Windows\\Fonts\\sylfaen.ttf VolumeInformation", "C:\\Windows\\Fonts\\symbol.ttf VolumeInformation", "C:\\Windows\\Fonts\\tahoma.ttf VolumeInformation", "C:\\Windows\\Fonts\\tahomabd.ttf VolumeInformation", "C:\\Windows\\Fonts\\timesi.ttf VolumeInformation", "C:\\Windows\\Fonts\\timesbd.ttf VolumeInformation", "C:\\Windows\\Fonts\\timesbi.ttf VolumeInformation", "C:\\Windows\\Fonts\\trebuc.ttf VolumeInformation", "C:\\Windows\\Fonts\\trebucit.ttf VolumeInformation", "C:\\Windows\\Fonts\\trebucbd.ttf VolumeInformation", "C:\\Windows\\Fonts\\trebucbi.ttf VolumeInformation", "C:\\Windows\\Fonts\\verdana.ttf VolumeInformation", "C:\\Windows\\Fonts\\verdanai.ttf VolumeInformation", "C:\\Windows\\Fonts\\verdanab.ttf VolumeInformation", "C:\\Windows\\Fonts\\verdanaz.ttf VolumeInformation", "C:\\Windows\\Fonts\\webdings.ttf VolumeInformation", "C:\\Windows\\Fonts\\wingding.ttf VolumeInformation", "C:\\Windows\\Fonts\\YuGothR.ttc VolumeInformation", "C:\\Windows\\Fonts\\YuGothM.ttc VolumeInformation", "C:\\Windows\\Fonts\\YuGothL.ttc VolumeInformation", "C:\\Windows\\Fonts\\YuGothB.ttc VolumeInformation", "C:\\Windows\\Fonts\\CENTURY.TTF VolumeInformation", "C:\\Windows\\Fonts\\LEELAWAD.TTF VolumeInformation", "C:\\Windows\\Fonts\\LEELAWDB.TTF VolumeInformation", "C:\\Windows\\Fonts\\MSUIGHUR.TTF VolumeInformation", "C:\\Windows\\Fonts\\MSUIGHUB.TTF VolumeInformation", "C:\\Windows\\Fonts\\WINGDNG2.TTF VolumeInformation", "C:\\Windows\\Fonts\\WINGDNG3.TTF VolumeInformation", "C:\\Windows\\Fonts\\ALGER.TTF VolumeInformation", "C:\\Windows\\Fonts\\BASKVILL.TTF VolumeInformation", "C:\\Windows\\Fonts\\BAUHS93.TTF VolumeInformation", "C:\\Windows\\Fonts\\BELL.TTF VolumeInformation", "C:\\Windows\\Fonts\\BELLI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BELLB.TTF VolumeInformation", "C:\\Windows\\Fonts\\BRLNSR.TTF VolumeInformation", "C:\\Windows\\Fonts\\BRLNSDB.TTF VolumeInformation", "C:\\Windows\\Fonts\\BRLNSB.TTF VolumeInformation", "C:\\Windows\\Fonts\\BERNHC.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_PSTC.TTF VolumeInformation", "C:\\Windows\\Fonts\\BRITANIC.TTF VolumeInformation", "C:\\Windows\\Fonts\\BROADW.TTF VolumeInformation", "C:\\Windows\\Fonts\\BRUSHSCI.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALIFR.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALIFI.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALIFB.TTF VolumeInformation", "C:\\Windows\\Fonts\\CENTAUR.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOTHIC.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOTHICI.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOTHICB.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOTHICBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\CHILLER.TTF VolumeInformation", "C:\\Windows\\Fonts\\COLONNA.TTF VolumeInformation", "C:\\Windows\\Fonts\\COOPBL.TTF VolumeInformation", "C:\\Windows\\Fonts\\FTLTLT.TTF VolumeInformation", "C:\\Windows\\Fonts\\FREESCPT.TTF VolumeInformation", "C:\\Windows\\Fonts\\HARLOWSI.TTF VolumeInformation", "C:\\Windows\\Fonts\\HARNGTON.TTF VolumeInformation", "C:\\Windows\\Fonts\\HTOWERT.TTF VolumeInformation", "C:\\Windows\\Fonts\\HTOWERTI.TTF VolumeInformation", "C:\\Windows\\Fonts\\JOKERMAN.TTF VolumeInformation", "C:\\Windows\\Fonts\\JUICE___.TTF VolumeInformation", "C:\\Windows\\Fonts\\ITCKRIST.TTF VolumeInformation", "C:\\Windows\\Fonts\\KUNSTLER.TTF VolumeInformation", "C:\\Windows\\Fonts\\LBRITE.TTF VolumeInformation", "C:\\Windows\\Fonts\\LBRITED.TTF VolumeInformation", "C:\\Windows\\Fonts\\LBRITEI.TTF VolumeInformation", "C:\\Windows\\Fonts\\LBRITEDI.TTF VolumeInformation", "C:\\Windows\\Fonts\\LCALLIG.TTF VolumeInformation", "C:\\Windows\\Fonts\\LFAX.TTF VolumeInformation", "C:\\Windows\\Fonts\\LFAXD.TTF VolumeInformation", "C:\\Windows\\Fonts\\LFAXI.TTF VolumeInformation", "C:\\Windows\\Fonts\\LFAXDI.TTF VolumeInformation", "C:\\Windows\\Fonts\\LHANDW.TTF VolumeInformation", "C:\\Windows\\Fonts\\MAGNETOB.TTF VolumeInformation", "C:\\Windows\\Fonts\\MATURASC.TTF VolumeInformation", "C:\\Windows\\Fonts\\MISTRAL.TTF VolumeInformation", "C:\\Windows\\Fonts\\MOD20.TTF VolumeInformation", "C:\\Windows\\Fonts\\MTCORSVA.TTF VolumeInformation", "C:\\Windows\\Fonts\\NIAGENG.TTF VolumeInformation", "C:\\Windows\\Fonts\\NIAGSOL.TTF VolumeInformation", "C:\\Windows\\Fonts\\OLDENGL.TTF VolumeInformation", "C:\\Windows\\Fonts\\ONYX.TTF VolumeInformation", "C:\\Windows\\Fonts\\PARCHM.TTF VolumeInformation", "C:\\Windows\\Fonts\\PLAYBILL.TTF VolumeInformation", "C:\\Windows\\Fonts\\POORICH.TTF VolumeInformation", "C:\\Windows\\Fonts\\RAVIE.TTF VolumeInformation", "C:\\Windows\\Fonts\\INFROMAN.TTF VolumeInformation", "C:\\Windows\\Fonts\\SHOWG.TTF VolumeInformation", "C:\\Windows\\Fonts\\SNAP____.TTF VolumeInformation", "C:\\Windows\\Fonts\\STENCIL.TTF VolumeInformation", "C:\\Windows\\Fonts\\TEMPSITC.TTF VolumeInformation", "C:\\Windows\\Fonts\\VINERITC.TTF VolumeInformation", "C:\\Windows\\Fonts\\VIVALDII.TTF VolumeInformation", "C:\\Windows\\Fonts\\VLADIMIR.TTF VolumeInformation", "C:\\Windows\\Fonts\\LATINWD.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCM_____.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCMI____.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCB_____.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCBI____.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCCM____.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCCB____.TTF VolumeInformation", "C:\\Windows\\Fonts\\TCCEB.TTF VolumeInformation", "C:\\Windows\\Fonts\\SCRIPTBL.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCK.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCKI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCKB.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCKEB.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCKBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCC____.TTF VolumeInformation", "C:\\Windows\\Fonts\\ROCCB___.TTF VolumeInformation", "C:\\Windows\\Fonts\\RAGE.TTF VolumeInformation", "C:\\Windows\\Fonts\\PRISTINA.TTF VolumeInformation", "C:\\Windows\\Fonts\\PERTILI.TTF VolumeInformation", "C:\\Windows\\Fonts\\PERTIBD.TTF VolumeInformation", "C:\\Windows\\Fonts\\PER_____.TTF VolumeInformation", "C:\\Windows\\Fonts\\PERI____.TTF VolumeInformation", "C:\\Windows\\Fonts\\PERB____.TTF VolumeInformation", "C:\\Windows\\Fonts\\PERBI___.TTF VolumeInformation", "C:\\Windows\\Fonts\\PAPYRUS.TTF VolumeInformation", "C:\\Windows\\Fonts\\PALSCRI.TTF VolumeInformation", "C:\\Windows\\Fonts\\OCRAEXT.TTF VolumeInformation", "C:\\Windows\\Fonts\\MAIAN.TTF VolumeInformation", "C:\\Windows\\Fonts\\LTYPE.TTF VolumeInformation", "C:\\Windows\\Fonts\\LTYPEO.TTF VolumeInformation", "C:\\Windows\\Fonts\\LTYPEB.TTF VolumeInformation", "C:\\Windows\\Fonts\\LTYPEBO.TTF VolumeInformation", "C:\\Windows\\Fonts\\LSANS.TTF VolumeInformation", "C:\\Windows\\Fonts\\LSANSD.TTF VolumeInformation", "C:\\Windows\\Fonts\\LSANSI.TTF VolumeInformation", "C:\\Windows\\Fonts\\LSANSDI.TTF VolumeInformation", "C:\\Windows\\Fonts\\IMPRISHA.TTF VolumeInformation", "C:\\Windows\\Fonts\\HATTEN.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOUDYSTO.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOUDOS.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOUDOSI.TTF VolumeInformation", "C:\\Windows\\Fonts\\GOUDOSB.TTF VolumeInformation", "C:\\Windows\\Fonts\\GLECB.TTF VolumeInformation", "C:\\Windows\\Fonts\\GIL_____.TTF VolumeInformation", "C:\\Windows\\Fonts\\GILI____.TTF VolumeInformation", "C:\\Windows\\Fonts\\GILB____.TTF VolumeInformation", "C:\\Windows\\Fonts\\GILBI___.TTF VolumeInformation", "C:\\Windows\\Fonts\\GILC____.TTF VolumeInformation", "C:\\Windows\\Fonts\\GLSNECB.TTF VolumeInformation", "C:\\Windows\\Fonts\\GIGI.TTF VolumeInformation", "C:\\Windows\\Fonts\\GARA.TTF VolumeInformation", "C:\\Windows\\Fonts\\GARAIT.TTF VolumeInformation", "C:\\Windows\\Fonts\\GARABD.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRSCRIPT.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRABK.TTF VolumeInformation", "C:\\Windows\\Fonts\\FRABKIT.TTF VolumeInformation", "C:\\Windows\\Fonts\\FORTE.TTF VolumeInformation", "C:\\Windows\\Fonts\\FELIXTI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ERASMD.TTF VolumeInformation", "C:\\Windows\\Fonts\\ERASLGHT.TTF VolumeInformation", "C:\\Windows\\Fonts\\ERASDEMI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ERASBD.TTF VolumeInformation", "C:\\Windows\\Fonts\\ENGR.TTF VolumeInformation", "C:\\Windows\\Fonts\\ELEPHNT.TTF VolumeInformation", "C:\\Windows\\Fonts\\ELEPHNTI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ITCEDSCR.TTF VolumeInformation", "C:\\Windows\\Fonts\\CURLZ___.TTF VolumeInformation", "C:\\Windows\\Fonts\\COPRGTL.TTF VolumeInformation", "C:\\Windows\\Fonts\\COPRGTB.TTF VolumeInformation", "C:\\Windows\\Fonts\\CENSCBK.TTF VolumeInformation", "C:\\Windows\\Fonts\\SCHLBKI.TTF VolumeInformation", "C:\\Windows\\Fonts\\SCHLBKB.TTF VolumeInformation", "C:\\Windows\\Fonts\\SCHLBKBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\CASTELAR.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALIST.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALISTI.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALISTB.TTF VolumeInformation", "C:\\Windows\\Fonts\\CALISTBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BRADHITC.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOOKOS.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOOKOSB.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOOKOSI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOOKOSBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BKANT.TTF VolumeInformation", "C:\\Windows\\Fonts\\ANTQUAI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ANTQUAB.TTF VolumeInformation", "C:\\Windows\\Fonts\\ANTQUABI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_R.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_I.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_B.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_BI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_CR.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_BLAR.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_CI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_CB.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_BLAI.TTF VolumeInformation", "C:\\Windows\\Fonts\\BOD_CBI.TTF VolumeInformation", "C:\\Windows\\Fonts\\ITCBLKAD.TTF VolumeInformation", "C:\\Windows\\Fonts\\ARLRDBD.TTF VolumeInformation", "C:\\Windows\\Fonts\\AGENCYR.TTF VolumeInformation", "C:\\Windows\\Fonts\\AGENCYB.TTF VolumeInformation", "C:\\Windows\\Fonts\\marlett.ttf VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Microsoft.VisualBasic\\v4.0_10.0.0.0__b03f5f7f11d50a3a\\Microsoft.VisualBasic.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Microsoft.PowerShell.ConsoleHost\\v4.0_3.0.0.0__31bf3856ad364e35\\Microsoft.PowerShell.ConsoleHost.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Management.Automation\\v4.0_3.0.0.0__31bf3856ad364e35\\System.Management.Automation.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Numerics\\v4.0_4.0.0.0__b77a5c561934e089\\System.Numerics.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.DirectoryServices\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\System.DirectoryServices.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_32\\System.Data\\v4.0_4.0.0.0__b77a5c561934e089\\System.Data.dll VolumeInformation", "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Microsoft-Windows-Client-Features-Package00113~31bf3856ad364e35~amd64~~10.0.17134.1.cat VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Microsoft.PowerShell.Security\\v4.0_3.0.0.0__31bf3856ad364e35\\Microsoft.PowerShell.Security.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_32\\System.Transactions\\v4.0_4.0.0.0__b77a5c561934e089\\System.Transactions.dll VolumeInformation", "C:\\ VolumeInformation", "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Microsoft-Windows-GroupPolicy-ClientTools-WOW64-ds-Package~31bf3856ad364e35~amd64~~10.0.17134.1.cat VolumeInformation", "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Microsoft-Windows-AppManagement-AppV-WOW64-Package~31bf3856ad364e35~amd64~~10.0.17134.1.cat VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_32\\Microsoft.Management.Infrastructure.Native\\v4.0_1.0.0.0__31bf3856ad364e35\\Microsoft.Management.Infrastructure.Native.dll VolumeInformation", "C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\Modules\\AppvClient\\Microsoft.AppV.AppVClientPowerShell.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_32\\Microsoft.AppV.AppvClientComConsumer\\v4.0_10.0.0.0__31bf3856ad364e35\\Microsoft.AppV.AppvClientComConsumer.dll VolumeInformation", "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Microsoft-Windows-SecureStartup-Subsystem-WOW64-base-Package~31bf3856ad364e35~amd64~~10.0.17134.1.cat VolumeInformation", "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Microsoft-Windows-SecureStartup-Subsystem-WOW64-base-Package~31bf3856ad364e35~amd64~en-US~10.0.17134.1.cat VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Microsoft.PowerShell.Commands.Utility\\v4.0_3.0.0.0__31bf3856ad364e35\\Microsoft.PowerShell.Commands.Utility.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Configuration.Install\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\System.Configuration.Install.dll VolumeInformation", "C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\Modules\\BitLocker\\Microsoft.BitLocker.Structures.dll VolumeInformation", "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Windows-Defender-Management-Powershell-Group-WOW64-Package~31bf3856ad364e35~amd64~~10.0.17134.1.cat VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Microsoft.PowerShell.Commands.Management\\v4.0_3.0.0.0__31bf3856ad364e35\\Microsoft.PowerShell.Commands.Management.dll VolumeInformation", "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Security\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\System.Security.dll VolumeInformation", "C:\\Users\\user\\AppData\\Roaming\\eLfOjcpKuVq.exe VolumeInformation"]}, {"severity": "INFO", "description": "Queries the cryptographic machine GUID", "match_data": ["HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography MachineGuid"]}, {"severity": "INFO", "description": "Reads software policies", "match_data": ["HKEY_CURRENT_USER\\Software\\Policies\\Microsoft\\Windows\\Safer\\CodeIdentifiers"]}, {"severity": "LOW", "description": "Queries BIOS Information (via WMI, Win32_Bios)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_BaseBoard"]}, {"severity": "INFO", "description": "Queries process information (via WMI, Win32_Process)", "match_data": ["IWbemServices::CreateInstanceEnum - root\\cimv2 : Win32_Processor", "IWbemServices::ExecQuery - root\\cimv2 : SELECT * FROM Win32_Processor"]}, {"severity": "INFO", "description": "Checks if Microsoft Office is installed", "match_data": ["HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\11.0\\Outlook\\Profiles"]}]}]}, {"id": "TA0006", "name": "Credential Access", "link": "https://attack.mitre.org/tactics/TA0006/", "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.", "techniques": [{"id": "T1003", "name": "OS Credential Dumping", "link": "https://attack.mitre.org/techniques/T1003/", "description": "Adversaries may attempt to dump credentials to obtain account login and credential material, normally in the form of a hash or a clear text password. Credentials can be obtained from OS caches, memory, or structures. Credentials can then be used to perform Lateral Movement and access restricted information.\nSeveral of the tools mentioned in associated sub-techniques may be used by both adversaries and professional security testers. Additional custom tools likely exist as well.", "signatures": [{"severity": "LOW", "description": "Tries to harvest and steal browser information (history, passwords, etc)", "match_data": ["C:\\Users\\user\\AppData\\Roaming\\Mozilla\\Firefox\\profiles.ini", "C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data", "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Login Data"]}]}, {"id": "T1056", "name": "Input Capture", "link": "https://attack.mitre.org/techniques/T1056/", "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).", "signatures": [{"severity": "INFO", "description": "Creates a DirectInput object (often for capturing keystrokes)", "match_data": ["      <HOOK MODULE=\"DDRAW.DLL\" FUNCTION=\"DirectDrawCreateEx\"/>"]}]}, {"id": "T1552", "name": "Unsecured Credentials", "link": "https://attack.mitre.org/techniques/T1552/", "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials. These credentials can be stored and/or misplaced in many locations on a system, including plaintext files (e.g. Bash History), operating system or application-specific repositories (e.g. Credentials in Registry),  or other specialized files/artifacts (e.g. Private Keys)."}, {"id": "T1552.002", "name": "Credentials in Registry", "link": "https://attack.mitre.org/techniques/T1552/002/", "description": "Adversaries may search the Registry on compromised systems for insecurely stored credentials. The Windows Registry stores configuration information that can be used by the system or other programs. Adversaries may query the Registry looking for credentials and passwords that have been stored for use by other programs or services. Sometimes these credentials are used for automatic logons.\nExample commands to find Registry keys related to password information: \n\nLocal Machine Hive: reg query HKLM /f password /t REG_SZ /s\nCurrent User Hive: reg query HKCU /f password /t REG_SZ /s\n", "signatures": [{"severity": "LOW", "description": "Tries to harvest and steal Putty information (sessions, passwords, etc)", "match_data": ["HKEY_CURRENT_USER\\SOFTWARE\\Martin Prikryl\\WinSCP 2\\Sessions"]}]}]}, {"id": "TA0009", "name": "Collection", "link": "https://attack.mitre.org/tactics/TA0009/", "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.", "techniques": [{"id": "T1056", "name": "Input Capture", "link": "https://attack.mitre.org/techniques/T1056/", "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).", "signatures": [{"severity": "INFO", "description": "Creates a DirectInput object (often for capturing keystrokes)", "match_data": ["      <HOOK MODULE=\"DDRAW.DLL\" FUNCTION=\"DirectDrawCreateEx\"/>"]}]}, {"id": "T1114", "name": "Email Collection", "link": "https://attack.mitre.org/techniques/T1114/", "description": "Adversaries may target user email to collect sensitive information. Emails may contain sensitive data, including trade secrets or personal information, that can prove valuable to adversaries. Emails may also contain details of ongoing incident response operations, which may allow adversaries to adjust their techniques in order to maintain persistence or evade defenses. Adversaries can collect or forward email from mail servers or clients. ", "signatures": [{"severity": "LOW", "description": "Tries to search for mail accounts", "match_data": ["C:\\Users\\user\\AppData\\Roaming\\Thunderbird\\profiles.ini", "HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows Messaging Subsystem\\Profiles", "HKEY_CURRENT_USER\\Software\\IncrediMail\\Identities"]}]}, {"id": "T1005", "name": "Data from Local System", "link": "https://attack.mitre.org/techniques/T1005/", "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, or virtual machine files, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.", "signatures": [{"severity": "LOW", "description": "Tries to harvest and steal browser information (history, passwords, etc)", "match_data": ["C:\\Users\\user\\AppData\\Roaming\\Mozilla\\Firefox\\profiles.ini", "C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data", "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Login Data"]}]}]}, {"id": "TA0011", "name": "Command and Control", "link": "https://attack.mitre.org/tactics/TA0011/", "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.", "techniques": [{"id": "T1571", "name": "Non-Standard Port", "link": "https://attack.mitre.org/techniques/T1571/", "description": "Adversaries may communicate using a protocol and port pairing that are typically not associated. For example, HTTPS over port 8088 or port 587 as opposed to the traditional port 443. Adversaries may make changes to the standard port used by a protocol to bypass filtering or muddle analysis/parsing of network data.\nAdversaries may also make changes to victim systems to abuse non-standard ports. For example, Registry keys and other configuration settings can be used to modify protocol and port pairings.", "signatures": [{"severity": "INFO", "description": "Detected TCP or UDP traffic on non-standard ports", "match_data": ["192.168.2.9:49704 -> 45.95.168.74:587"]}]}, {"id": "T1095", "name": "Non-Application Layer Protocol", "link": "https://attack.mitre.org/techniques/T1095/", "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.", "signatures": [{"severity": "INFO", "description": "Performs DNS lookups", "match_data": ["queries for: mail.abi0expertise.com"]}]}, {"id": "T1071", "name": "Application Layer Protocol", "link": "https://attack.mitre.org/techniques/T1071/", "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ", "signatures": [{"severity": "INFO", "description": "Performs DNS lookups", "match_data": ["queries for: mail.abi0expertise.com"]}, {"severity": "INFO", "description": "Uses SMTP (mail sending)", "match_data": ["192.168.2.9:49704 -> 45.95.168.74:587"]}]}]}]}}, "links": {"self": "https://www.virustotal.com/api/v3/files/8c3df75077ed123924224935250b7ea35f29f38bee3f2e2fa40e3cbbd3d81a69/behaviour_mitre_trees"}}